src/Reports/ОтчетОПоощренияхВзысканиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетОПоощренияхВзысканиях</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоощрения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поощрения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВзыскания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятиеВзыскания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СплошнаяНумерация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ОтчетОПоощренияхВзысканиях/Ext/ObjectModule.bsl
Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда
	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокАттестации, ДокументРезультат)
	
	Пока ВыборкаСтрокАттестации.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокАттестации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокАттестации.ПодразделениеОрганизации Тогда	
			
			Если НЕ СплошнаяНумерация Тогда //СВЭЙ 21.05.2024 КВВ СВФР-012926
				мНомер = 0;
			КонецЕсли;
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			
			//Аверсон ЕАЕ 24.02.2025 СВФР-014999
			//Климовичи
			//ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
			Если Орг.ИНН = "700103211" Тогда
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа2");	
			Иначе
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокАттестации.ПодразделениеОрганизации.Код);
			КонецЕсли;
			//ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокАттестации.ПодразделениеОрганизации.Код);
			//Аверсон СВФР-014999
			
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокАттестации.ПодразделениеОрганизации.Наименование;				
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокАттестации.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокАттестации.Сотрудник.Наименование;
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокАттестации.Должность;
			Если ТипОтчета  = 1 Тогда
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаПоощрения;
				ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Текст = ВыборкаСтрокАттестации.ТекстПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Тип = ВыборкаСтрокАттестации.ТипПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.ПримечаниеПоощрения;
			ИначеЕсли ТипОтчета  = 2 Тогда
				Если Не СнятиеВзыскания Тогда
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаВзыскания;
					ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Текст = ВыборкаСтрокАттестации.ТекстВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Тип = ВыборкаСтрокАттестации.ТипВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.ПримечаниеВзыскания;
				Иначе
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаСнятияВзыскания;
					ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаСнятияВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Текст = "";
					ОбластьДетальныхЗаписей.Параметры.Тип = "";
					ОбластьДетальныхЗаписей.Параметры.Примечание = "";					
				КонецЕсли;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокАттестации.ПодразделениеОрганизации;
		Иначе
			
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокАттестации.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокАттестации.Сотрудник.Наименование;
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокАттестации.Должность;
			Если ТипОтчета  = 1 Тогда
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаПоощрения;
				ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Текст = ВыборкаСтрокАттестации.ТекстПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Тип = ВыборкаСтрокАттестации.ТипПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.ПримечаниеПоощрения;
			ИначеЕсли ТипОтчета  = 2 Тогда
				Если Не СнятиеВзыскания Тогда
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаВзыскания;
					ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Текст = ВыборкаСтрокАттестации.ТекстВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Тип = ВыборкаСтрокАттестации.ТипВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.ПримечаниеВзыскания;
				Иначе
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаСнятияВзыскания;
					ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаСнятияВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Текст = "";
					ОбластьДетальныхЗаписей.Параметры.Тип = "";
					ОбластьДетальныхЗаписей.Параметры.Примечание = "";					
				КонецЕсли;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокАттестации.ПодразделениеОрганизации;
		КонецЕсли;
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	мМакет = ПолучитьМакет("Макет");
	ТекПодр = "";
	Запрос = Новый Запрос;
	Если ТипОтчета = 1 Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ФизическиеЛицаПоощрения.ДатаПоощрения,
		|	ФизическиеЛицаПоощрения.НомерПриказаПоощрения,
		|	ФизическиеЛицаПоощрения.ТекстПоощрения,
		|	ФизическиеЛицаПоощрения.ТипПоощрения,
		|	ФизическиеЛицаПоощрения.ПримечаниеПоощрения,
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник
		|ИЗ
		|	Справочник.ФизическиеЛица.Поощрения КАК ФизическиеЛицаПоощрения
		
		//Аверсон ЕАЕ 04.11.2025 СВФР-017068
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|                              	РСРаботникиОрганизацийСрезПоследних.Сотрудник,
		|                              	РСРаботникиОрганизацийСрезПоследних.Должность,
		|                              	РСРаботникиОрганизацийСрезПоследних.Организация,
		|                              	РСРаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
		|                              ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РСРаботникиОрганизацийСрезПоследних 
		|                              ГДЕ РСРаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийСрезПоследних
		//Аверсон СВФР-017068
		
		|		ПО ФизическиеЛицаПоощрения.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
		|ГДЕ
		//|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
		|	ФизическиеЛицаПоощрения.ДатаПоощрения >= &ДатаНачала
		|	И ФизическиеЛицаПоощрения.ДатаПоощрения <= &ДатаОкончания
		|	//1 И ФизическиеЛицаПоощрения.ТипПоощрения = &ТипПоощрения
		|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
		|	//И РаботникиОрганизацийСрезПоследних.Категория = &Категория //СВЭЙ 21.05.2024 КВВ СВФР-012926
		
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник,
		|	ФизическиеЛицаПоощрения.ДатаПоощрения,
		|	ФизическиеЛицаПоощрения.НомерПриказаПоощрения,
		|	ФизическиеЛицаПоощрения.ТекстПоощрения,
		|	ФизическиеЛицаПоощрения.ТипПоощрения,
		|	ФизическиеЛицаПоощрения.ПримечаниеПоощрения,
		|	РаботникиОрганизацийСрезПоследних.Должность
		
		|УПОРЯДОЧИТЬ ПО
		|Приоритет Возр,
		|Сотрудник";
		
	ИначеЕсли ТипОтчета = 2 Тогда 
		Если Не СнятиеВзыскания Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ФизическиеЛицаВзыскания.ДатаВзыскания,
			|	ФизическиеЛицаВзыскания.НомерПриказаВзыскания,
			|	ФизическиеЛицаВзыскания.ТекстВзыскания,
			|	ФизическиеЛицаВзыскания.ТипВзыскания,
			|	ФизическиеЛицаВзыскания.ПримечаниеВзыскания,
			|	РаботникиОрганизацийСрезПоследних.Организация,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
			|	РаботникиОрганизацийСрезПоследних.Должность,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник
			|ИЗ
			|	Справочник.ФизическиеЛица.Взыскания КАК ФизическиеЛицаВзыскания
			
			//Аверсон ЕАЕ 04.11.2025 СВФР-017068
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|                              	РСРаботникиОрганизацийСрезПоследних.Сотрудник,
			|                              	РСРаботникиОрганизацийСрезПоследних.Должность,
			|                              	РСРаботникиОрганизацийСрезПоследних.Организация,
			|                              	РСРаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			|                              ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РСРаботникиОрганизацийСрезПоследних 
			|                              ГДЕ РСРаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийСрезПоследних
			//Аверсон СВФР-017068
			
			|		ПО ФизическиеЛицаВзыскания.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
			|ГДЕ
			//|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
			|	ФизическиеЛицаВзыскания.ДатаВзыскания >= &ДатаНачала
			|	И ФизическиеЛицаВзыскания.ДатаВзыскания <= &ДатаОкончания
			|	//1 И ФизическиеЛицаВзыскания.ТипВзыскания = &ТипВзыскания
			|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
			|	//И РаботникиОрганизацийСрезПоследних.Категория = &Категория //СВЭЙ 21.05.2024 КВВ СВФР-012926
			
			|СГРУППИРОВАТЬ ПО
			|	РаботникиОрганизацийСрезПоследних.Организация,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник,
			|	ФизическиеЛицаВзыскания.ДатаВзыскания,
			|	ФизическиеЛицаВзыскания.НомерПриказаВзыскания,
			|	ФизическиеЛицаВзыскания.ТекстВзыскания,
			|	ФизическиеЛицаВзыскания.ТипВзыскания,
			|	ФизическиеЛицаВзыскания.ПримечаниеВзыскания,
			|	РаботникиОрганизацийСрезПоследних.Должность
			
			|УПОРЯДОЧИТЬ ПО
			|Приоритет Возр,
			|Сотрудник";
			
		Иначе
			// заявка №1577 (база заявок Кристалл) Дмитрук О.Г.
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ФизическиеЛицаВзыскания.ДатаСнятияВзыскания,
			|	ФизическиеЛицаВзыскания.НомерПриказаСнятияВзыскания,
			|	РаботникиОрганизацийСрезПоследних.Организация,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
			|	РаботникиОрганизацийСрезПоследних.Должность,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник
			|ИЗ
			|	Справочник.ФизическиеЛица.Взыскания КАК ФизическиеЛицаВзыскания
			
			//Аверсон ЕАЕ 04.11.2025 СВФР-017068
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|                              	РСРаботникиОрганизацийСрезПоследних.Сотрудник,
			|                              	РСРаботникиОрганизацийСрезПоследних.Должность,
			|                              	РСРаботникиОрганизацийСрезПоследних.Организация,
			|                              	РСРаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			|                              ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РСРаботникиОрганизацийСрезПоследних 
			|                              ГДЕ РСРаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийСрезПоследних
			//Аверсон СВФР-017068
			
			|		ПО ФизическиеЛицаВзыскания.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
			|ГДЕ
			//|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
			|	ФизическиеЛицаВзыскания.ДатаСнятияВзыскания >= &ДатаНачала
			|	И ФизическиеЛицаВзыскания.ДатаСнятияВзыскания <= &ДатаОкончания
			|	//1 И ФизическиеЛицаВзыскания.ТипВзыскания = &ТипВзыскания
			|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
			|	//И РаботникиОрганизацийСрезПоследних.Категория = &Категория //СВЭЙ 21.05.2024 КВВ СВФР-012926
			
			|СГРУППИРОВАТЬ ПО
			|	РаботникиОрганизацийСрезПоследних.Организация,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник,
			|	ФизическиеЛицаВзыскания.ДатаСнятияВзыскания,
			|	ФизическиеЛицаВзыскания.НомерПриказаСнятияВзыскания,
			|	РаботникиОрганизацийСрезПоследних.Должность
			
			|УПОРЯДОЧИТЬ ПО
			|Приоритет Возр,
			|Сотрудник";
			
			// заявка №1577

		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	Запрос.УстановитьПараметр("ДатаНачала",НачПериод);
	Запрос.УстановитьПараметр("ДатаОкончания",КонПериод);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ТипОтчета = 1 Тогда
		Если Не ПустаяСтрока(ТипПоощрения) тогда
			Запрос.УстановитьПараметр("ТипПоощрения",      ТипПоощрения);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 И ФизическиеЛицаПоощрения.ТипПоощрения = &ТипПоощрения","И ФизическиеЛицаПоощрения.ТипПоощрения = &ТипПоощрения");
		КонецЕсли;
	ИначеЕсли ТипОтчета = 2 Тогда
		Если Не ПустаяСтрока(ТипВзыскания) тогда
			Запрос.УстановитьПараметр("ТипВзыскания",      ТипВзыскания);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 И ФизическиеЛицаВзыскания.ТипВзыскания = &ТипВзыскания","И ФизическиеЛицаВзыскания.ТипВзыскания = &ТипВзыскания");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)");
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;

	//СВЭЙ 21.05.2024 КВВ СВФР-012926 (
	Если ЗначениеЗаполнено(Категория) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И РаботникиОрганизацийСрезПоследних.Категория = &Категория","И РаботникиОрганизацийСрезПоследних.Категория = &Категория");
		 Запрос.УстановитьПараметр("Категория", Категория);
	КонецЕсли;
	//СВЭЙ 21.05.2024 КВВ СВФР-012926 )
	
	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;
	Область.Параметры.НаименованиеОтчета = ?(ТипОтчета = 1, "Отчет о поощрениях", "Отчет о взысканиях");
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

#КонецЕсли
